; domain
(define (domain roomba)

  (:requirements
    :typing
  )

  (:types
    robot
    location
  )

  (:predicates
    (at ?r - robot ?l - location)
    (clean ?l - location)
  )

  (:action move
    :parameters (?r - robot ?source ?destination - location)
    :precondition   (at ?r ?source)
    :effect         (and ( not (at ?r ?source))
                         (at ?r ?destination))
  )

  (:action clean
    :parameters (?r - robot ?l - location)
    :precondition   (and (at ?r ?l)
                         ( not (clean ?l))
                    )
    :effect         (clean ?l)
  )
)

; problem
(define (problem example_problem)
  (:domain roomba)

  (:objects
  	roomba - robot
  	a b - location
  )

  (:init
  	(at roomba a)
  )

  (:goal
  	(  and (at roomba a)
           (clean b)
           (clean a)
    )
  )
 )

; plan
1. (clean roomba a)
   added: (clean a)
   goals met: 2 of 3
2. (move roomba a b)
   deleted: (at roomba a)
   added: (at roomba b)
   goals met: 1 of 3
3. (clean roomba b)
   added: (clean b)
   goals met: 2 of 3
4. (move roomba b a)
   deleted: (at roomba b)
   added: (at roomba a)
   goals met: 3 of 3
